tap "homebrew/cask-fonts"
tap "1password/tap"
tap "jakehilborn/jakehilborn"

brew "youtube-dl"
brew "diff-so-fancy"
brew "pyenv"
brew "pyenv-virtualenv"
brew "awscli"
brew "gradle"
brew "kotlin"
brew "ack"
brew "cloc"
brew "envchain"
brew "exiftool"
brew "curl"
brew "git"
brew "node"
brew "python@3.9"
brew "readline"
brew "thefuck"
brew "tfenv"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "ghc"
brew "jq"
brew "yq"
brew "yamllint"
brew "gh"
brew "fzf"
brew "ktlint"
brew "lazygit"
brew "displayplacer" # from jakehilborn/jakehilborn
brew "macchina"

cask "idrive"
cask "flameshot"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "discord"
cask "docker"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "grandperspective" 
cask "intellij-idea"
cask "obsidian"
cask "rectangle"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
cask "microsoft-teams"
cask "arc"
cask "google-chrome"
cask "firefox"
cask "signal"
cask "postman"
cask "sublime-text"
cask "atom"
cask "vlc"
cask "docker"
cask "steam"
cask "slack"
cask "caffeine"
cask "iterm2"
